Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedMemberLoad Class
 The AnalysisDecomposedMemberLoad class contains information related to decomposed member loads.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisDecomposedLoad
 Tekla.Structures.Analysis.AnalysisDecomposedMemberLoad
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisDecomposedMemberLoad : AnalysisDecomposedLoad
Public NotInheritable Class AnalysisDecomposedMemberLoad
	Inherits AnalysisDecomposedLoad
The AnalysisDecomposedMemberLoad type exposes the following members.
Constructors
Name | Description
AnalysisDecomposedMemberLoad
 Initializes a new instance of the AnalysisDecomposedMemberLoad class.
Top
Properties
Name | Description
AnalysisLoadType
 Gets or sets the type of the analysis decomposed load.
 (Inherited from AnalysisDecomposedLoad.)
AnalysisModelName
 Gets or sets the analysis model name.
 (Inherited from AnalysisObject.)
AnalysisObjectType
 Gets or sets the type of the analysis object.
 (Inherited from AnalysisObject.)
CSCode
 Gets or sets the CS code of the decomposed member load.
EndDistance
 Gets or sets the end distance of the decomposed member load.
EndValue
 Gets or sets the end value of the decomposed member load.
FatherObject2ID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObject2Type
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
FatherObjectID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObjectType
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
ID
 Gets or sets the identifier of the analysis object.
 (Inherited from AnalysisObject.)
ModelLoadGroupID
 Gets or sets the identifier of the load group.
 (Inherited from AnalysisDecomposedLoad.)
ModelLoadID
 Gets or sets the identifier of the model load.
 (Inherited from AnalysisDecomposedLoad.)
ObjectAttachedToID
 Gets or sets the identifier of the object the load is attached to.
 (Inherited from AnalysisDecomposedLoad.)
ObjectAttachedToType
 Gets or sets the type of the object the load is attached to.
 (Inherited from AnalysisDecomposedLoad.)
StartDistance
 Gets or sets the start distance of the decomposed member load.
StartValue
 Gets or sets the start value of the decomposed member load.
Top
Methods
Name | Description
Select
 Selects the analysis decomposed member load.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
Tekla.Structures.Analysis Namespace